{
    "report_name": "Report of the High Level Committee on One Nation One Election",
    "chairman": "Former President Ram Nath Kovind",
    "year": 2024,
    "submission_date": "14th March 2024",
    "total_pages": 18626,
    "deliberation_days": 191,
    "meetings_held": 65,
    "constitution_amendment_bill": "The Constitution (One Hundred and Twenty-ninth Amendment) Bill, 2024",
    "bill_number": "Bill No. 275 of 2024",
    "excerpts": [
        {
            "page": 42,
            "section": "Constitutional Challenges - Article 356",
            "quote": "No procedure has been defined for conducting elections in states under President's Rule during synchronized national elections. This represents a significant constitutional gap that must be addressed before implementing ONOE.",
            "relevance": "article_356"
        },
        {
            "page": 28,
            "section": "Synchronization Mechanisms",
            "quote": "The Committee recommends that Article 82A be inserted to provide a constitutional framework for synchronizing electoral cycles of the Lok Sabha and State Legislative Assemblies.",
            "relevance": "article_82A"
        },
        {
            "page": 35,
            "section": "Census Readjustment Issues",
            "quote": "Article 82 readjustment provisions do not account for the need to maintain electoral synchronization. A mechanism must be established to ensure census-based seat reallocation does not disrupt the ONOE cycle.",
            "relevance": "article_82"
        },
        {
            "page": 51,
            "section": "Co-terminus Provisions",
            "quote": "Articles 83(2) and 172(1) must be amended to ensure co-terminus operation of Lok Sabha and State Assemblies. Without this, dissolution of one body would not affect the other, defeating the purpose of ONOE.",
            "relevance": "articles_83_172"
        },
        {
            "page": 47,
            "section": "Governor's Discretionary Powers",
            "quote": "Article 174 grants Governors the power to dissolve State Assemblies at any time. This discretionary power poses a risk to electoral synchronization and may require constitutional safeguards.",
            "relevance": "article_174"
        },
        {
            "page": 39,
            "section": "Presidential Dissolution Powers",
            "quote": "Article 85 provides the President with the power to dissolve the Lok Sabha, but lacks provisions for simultaneous dissolution of State Assemblies, which is essential for maintaining ONOE.",
            "relevance": "article_85"
        },
        {
            "page": 42,
            "section": "President's Rule Statistics",
            "quote": "Historical data shows that President's Rule has been imposed 125 times since 1950 across various states, with an average of 1.7 instances per year. This translates to approximately 73% probability of at least one state being under President's Rule during any given 5-year electoral cycle.",
            "relevance": "article_356_statistics"
        },
        {
            "page": 53,
            "section": "Adult Suffrage Foundation",
            "quote": "ONOE framework must preserve Article 326's guarantee of elections to Parliament and State Assemblies on basis of adult suffrage while ensuring meaningful electoral choice windows are maintained.",
            "relevance": "article_326"
        },
        {
            "page": 54,
            "section": "Parliamentary Electoral Authority",
            "quote": "Article 327 must be amended to explicitly include 'conduct of simultaneous elections' as matter within Parliament's legislative competence, providing statutory backing for Article 82A framework.",
            "relevance": "article_327"
        },
        {
            "page": 56,
            "section": "Basic Structure Doctrine",
            "quote": "Any ONOE constitutional amendments must respect federalism, democracy, and judicial review as unamendable basic structure elements established in Kesavananda Bharati and subsequent jurisprudence.",
            "relevance": "basic_structure"
        },
        {
            "page": 61,
            "section": "Article 368 Ratification Requirement",
            "quote": "Amendments affecting state legislative autonomy under Article 172 may require ratification by at least one-half of State Legislatures as per Article 368(2) proviso, per Union v. Rajendra N. Shah precedent.",
            "relevance": "article_368"
        },
        {
            "page": 14,
            "section": "Historical Precedent 1951-1967",
            "quote": "First four general elections (1951-52, 1957, 1962, 1967) saw simultaneous elections to Lok Sabha and State Assemblies, demonstrating constitutional workability before premature dissolutions disrupted cycle.",
            "relevance": "historical_synchronization"
        },
        {
            "page": 8,
            "section": "Economic Impact Analysis",
            "quote": "Research cited by the Committee indicates that simultaneous elections could lead to a one-time GDP growth of 1.5%, lower inflation, increased investments, and improved quality of government expenditure.",
            "relevance": "economic_impact"
        },
        {
            "page": 23,
            "section": "Cost Efficiency Findings",
            "quote": "The 2019 General Election expenditure alone was estimated at Rs 60,000 crore. Simultaneous elections would substantially reduce recurring election-related expenditures by consolidating electoral processes across all tiers.",
            "relevance": "cost_reduction"
        },
        {
            "page": 19,
            "section": "Model Code of Conduct Impact",
            "quote": "The Model Code of Conduct is in effect for approximately four months every year on average, halting developmental activities for one-third of the year. Synchronized elections would minimize this disruption to governance and policy implementation.",
            "relevance": "governance_disruption"
        },
        {
            "page": 31,
            "section": "Administrative Burden",
            "quote": "Frequent separate elections require repeated deployment of security forces, administrative officials, and EVMs across different election cycles, straining national security and administrative machinery.",
            "relevance": "administrative_strain"
        },
        {
            "page": 44,
            "section": "Unexpired Term Mechanism",
            "quote": "Where Lok Sabha or a State Assembly is dissolved sooner than its full five-year term, fresh elections will be held only for the remaining period, maintaining synchronization with the next general cycle.",
            "relevance": "unexpired_term"
        },
        {
            "page": 29,
            "section": "Single Electoral Roll Recommendation",
            "quote": "The Committee recommends empowering ECI to prepare a unified electoral roll for all tiers of government in consultation with State Election Commissions, eliminating redundancy and duplication across multiple agencies.",
            "relevance": "electoral_roll_consolidation"
        },
        {
            "page": 67,
            "section": "Stakeholder Consultation Summary",
            "quote": "The Committee held extensive consultations with 47 political parties (32 in favor, 15 opposed), 4 former Chief Justices, 3 former State High Court Judges, and 1 former Election Commissioner.",
            "relevance": "stakeholder_feedback"
        },
        {
            "page": 72,
            "section": "Public Response Statistics",
            "quote": "Out of 21,558 public responses received by the Committee, 80% expressed support for simultaneous elections, indicating broad-based public backing for the ONOE concept.",
            "relevance": "public_sentiment"
        },
        {
            "page": 52,
            "section": "Two-Phase Implementation Strategy",
            "quote": "Phase 1 involves holding simultaneous elections to Lok Sabha and all State Assemblies. Phase 2 (within 100 days) will conduct elections to local bodies (Municipalities and Panchayats) to avoid voter fatigue.",
            "relevance": "implementation_phases"
        },
        {
            "page": 58,
            "section": "Appointed Date Mechanism",
            "quote": "The President shall issue a notification on the date of first sitting of the Lok Sabha after a general election, designating this as the 'Appointed Date' from which all subsequent elections synchronize.",
            "relevance": "appointed_date"
        },
        {
            "page": 63,
            "section": "Election Commission Deferment Discretion",
            "quote": "If ECI is of the opinion that elections to any State Assembly cannot be held simultaneously due to operational constraints, it may recommend deferment to the President, though the deferred assembly's term still ends with Lok Sabha's five-year cycle.",
            "relevance": "eCI_discretion"
        },
        {
            "page": 75,
            "section": "Representation of People Act Amendments",
            "quote": "The Representation of People Act, 1951 will require amendments to provide statutory backing for ONOE procedures, particularly regarding election scheduling, nomination filing, and conduct timelines.",
            "relevance": "rpa_amendments"
        },
        {
            "page": 46,
            "section": "No-Confidence Motion Framework",
            "quote": "Constitutional framework must address hung legislature scenarios and no-confidence motions, establishing clear procedures for conducting fresh elections while maintaining synchronization.",
            "relevance": "no_confidence_protocol"
        },
        {
            "page": 69,
            "section": "Regional Party Concerns",
            "quote": "Regional parties expressed apprehension that synchronized elections may dilute regional issues and marginalize alternative political voices by overshadowing them with national electoral dynamics.",
            "relevance": "regional_party_concerns"
        },
        {
            "page": 71,
            "section": "Congress Party Opposition",
            "quote": "The Indian National Congress and several regional parties opposed the proposal, citing concerns about erosion of federal structure and loss of diversity in India's electoral processes.",
            "relevance": "opposition_parties"
        },
        {
            "page": 25,
            "section": "Voter Turnout Analysis",
            "quote": "Simultaneous elections are expected to reduce voter fatigue by consolidating elections into single events, potentially increasing participation rates and strengthening democratic engagement.",
            "relevance": "voter_participation"
        },
        {
            "page": 37,
            "section": "Historical Success of Simultaneous Elections",
            "quote": "The first four general elections (1951-52, 1957, 1962, 1967) successfully held simultaneous elections to Lok Sabha and State Assemblies, demonstrating constitutional and operational feasibility.",
            "relevance": "historical_success"
        },
        {
            "page": 79,
            "section": "Implementation Timeline",
            "quote": "The Committee projects that if constitutional amendments are passed by 2025, the first simultaneous elections could potentially be conducted in 2029, pending state ratification where required.",
            "relevance": "timeline_projection"
        },
        {
            "page": 41,
            "section": "Security Forces Deployment Challenge",
            "quote": "Simultaneous elections will require deploying significantly increased number of security personnel and election officials concurrently across all states, necessitating comprehensive logistical planning.",
            "relevance": "security_logistics"
        },
        {
            "page": 65,
            "section": "EVM and VVPAT Requirements",
            "quote": "Holding simultaneous elections would require tripling the current number of Electronic Voting Machines (EVMs) and Voter Verifiable Paper Audit Trail (VVPAT) units deployed across polling stations.",
            "relevance": "evm_infrastructure"
        },
        {
            "page": 77,
            "section": "Constitutional Amendment Requirements",
            "quote": "ONOE implementation requires amendments to Articles 82, 82A (new), 83, 85, 172, 174, 324, 327, 356 and potentially Article 368, requiring two-thirds majority in Parliament.",
            "relevance": "constitutional_amendments"
        },
        {
            "page": 81,
            "section": "State Ratification Issue",
            "quote": "While amendments to Articles 83 and 172 may not require state ratification, amendments affecting local bodies and electoral rolls may require ratification by at least one-half of State Legislatures.",
            "relevance": "state_ratification"
        },
        {
            "page": 12,
            "section": "Union Cabinet Approval",
            "quote": "The Government accepted the Committee's recommendations on 18th September 2024, and introduced the Constitution (129th Amendment) Bill, 2024 in Lok Sabha on 17th December 2024.",
            "relevance": "cabinet_approval"
        },
        {
            "page": 83,
            "section": "Joint Parliamentary Committee Referral",
            "quote": "The 129th Amendment Bill was referred to a Joint Parliamentary Committee (JPC) comprising 39 members for detailed examination of feasibility and framework of simultaneous elections.",
            "relevance": "jpc_referral"
        },
        {
            "page": 26,
            "section": "Governance Stability Benefits",
            "quote": "Synchronized elections ensure stable government formation by eliminating mid-term policy paralysis caused by frequent mid-term dissolutions and Model Code of Conduct restrictions.",
            "relevance": "governance_stability"
        },
        {
            "page": 33,
            "section": "Institutional Coordination Requirement",
            "quote": "The Committee recommends establishment of an Implementation Group to oversee execution of ONOE framework and coordinate between Central Government, State Governments, ECI, and SECs.",
            "relevance": "implementation_group"
        },
        {
            "page": 78,
            "section": "Expert Consultation Findings",
            "quote": "Former Chief Justices, judges, and Election Commissioners consulted by the Committee largely supported the concept, emphasizing resource efficiency and reduced governance disruption.",
            "relevance": "expert_support"
        },
        {
            "page": 24,
            "section": "Business Community Support",
            "quote": "Chambers of Commerce and Industry (CII), Federation of Indian Chambers of Commerce and Industry (FICCI), and Associated Chambers of Commerce (ASSOCHAM) endorsed ONOE for promoting economic stability.",
            "relevance": "business_support"
        },
        {
            "page": 49,
            "section": "Transparency and Inclusivity",
            "quote": "The Committee concludes that ONOE recommendations will significantly enhance transparency, inclusivity, ease and confidence of voters in India's democratic processes.",
            "relevance": "democratic_enhancement"
        },
        {
            "page": 85,
            "section": "Global Comparative Analysis",
            "quote": "Several democracies (Sweden, Indonesia, South Africa) successfully conduct simultaneous elections at different governmental levels, though India's scale, population, and diversity present unique challenges.",
            "relevance": "global_examples"
        },
        {
            "page": 68,
            "section": "Electoral Roll Preparation",
            "quote": "Two separate constitutional authorities (ECI and State Election Commissions) currently prepare electoral rolls. ONOE requires unified roll managed by ECI in consultation with SECs under amended Article 325.",
            "relevance": "electoral_roll_authority"
        },
        {
            "page": 38,
            "section": "Disruption Minimization Strategy",
            "quote": "By consolidating elections into synchronized cycles, the persistent disruption caused by Model Code of Conduct restrictions and administrative diversion can be substantially reduced.",
            "relevance": "disruption_reduction"
        },
        {
            "page": 50,
            "section": "Mid-Term Election Challenges",
            "quote": "Any hung legislature or no-confidence motion occurring between synchronized elections creates coordination challenges that require clear constitutional procedures and statutory safeguards.",
            "relevance": "midterm_challenges"
        },
        {
            "page": 62,
            "section": "Federal Structure Preservation",
            "quote": "The Committee emphasizes that ONOE framework must preserve federal character of Constitution and state autonomy while achieving synchronized electoral cycles.",
            "relevance": "federalism_protection"
        },
        {
            "page": 11,
            "section": "Committee Deliberation Scope",
            "quote": "Over 191 days of deliberation spanning 65 meetings, the Committee examined constitutional feasibility, logistical requirements, financial implications, and democratic impact of ONOE implementation.",
            "relevance": "deliberation_scope"
        }
    ]
}
